linux和它的小伙伴/linux下rar文件常用操作.org
#+TITLE: linux下rar文件常用操作
#+AUTHOR: lujun9972
#+TAGS: linux和它的小伙伴
#+DATE: [2018-06-07 四 15:15]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

* 安装rar命令
#+BEGIN_SRC shell :dir /sudo:: :results org
  sudo pacman -S rar --noconfirm
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
resolving dependencies...
looking for conflicting packages...

Packages (1) rar-5.5.0-1

Total Installed Size:  0.72 MiB
Net Upgrade Size:      0.00 MiB

:: Proceed with installation? [Y/n] 
(0/1) checking keys in keyring                     [----------------------]   0%(1/1) checking keys in keyring                     [######################] 100%
(0/1) checking package integrity                   [----------------------]   0%(1/1) checking package integrity                   [######################] 100%
(0/1) loading package files                        [----------------------]   0%(1/1) loading package files                        [######################] 100%
(0/1) checking for file conflicts                  [----------------------]   0%(1/1) checking for file conflicts                  [######################] 100%
(0/1) checking available disk space                [----------------------]   0%(1/1) checking available disk space                [######################] 100%
:: Processing package changes...
(1/1) reinstalling rar                             [----------------------]   0%(1/1) reinstalling rar                             [######################] 100%
:: Running post-transaction hooks...
(1/1) Arming ConditionNeedsUpdate...
#+END_SRC

