blog/2018/06/07/linux下rar文件常用操作/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>linux下rar文件常用操作 - 暗无天日</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="linux和它的小伙伴" />
  <link rel="stylesheet" media="screen" href="../../../../../media/css/font.css" rel="stylesheet" type="text/css"/>
  <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css">
  <link rel="stylesheet" href="../../../../../media/css/kdComment.css" type="text/css">
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="../../../../../">暗无天日</a></h1>
    <p>=============&gt;随便,谢谢</p>
    <nav class="site-nav">
      <div class="menu-icon">
      </div>
      <ul class="trigger">
              <li><a href="../../../../../years/">Years</a></li>
              <li><a href="../../../../../authors/">Authors</a></li>
              <li><a href="../../../../../tags/">Tags</a></li>
              <li><a href="../../../../../about/">About</a></li>
              <li><a href="https://github.com/lujun9972/lujun9972.github.com">Github</a></li>
              <li><a href="../../../../../rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
        <input type="text" class="field" name="q" id="s" placeholder="Search">
        <input type="hidden" name="as_sitesearch" value="lujun9972.github.io">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">linux下rar文件常用操作</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7cbfc50">安装rar命令</a></li>
<li><a href="#orgbdca082">rar命令常见操作</a>
<ul>
<li><a href="#org28ebb32">创建rar压缩包</a></li>
<li><a href="#org22582d6">查看压缩包的内容</a></li>
<li><a href="#org7eb6da6">压缩包解压</a></li>
<li><a href="#org617d49e">关于密码</a></li>
<li><a href="#org69b4840">设置压缩级别</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7cbfc50" class="outline-2">
<h2 id="org7cbfc50">安装rar命令</h2>
<div class="outline-text-2" id="text-org7cbfc50">
<div class="org-src-container">
<pre class="src src-shell">sudo pacman -S rar --noconfirm
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">resolving dependencies...
looking for conflicting packages...

Packages (1) rar-5.5.0-1

Total Installed Size:  0.72 MiB
Net Upgrade Size:      0.00 MiB

:: Proceed with installation? [Y/n] 
(0/1) checking keys in keyring                     [----------------------]   0%(1/1) checking keys in keyring                     [######################] 100%
(0/1) checking package integrity                   [----------------------]   0%(1/1) checking package integrity                   [######################] 100%
(0/1) loading package files                        [----------------------]   0%(1/1) loading package files                        [######################] 100%
(0/1) checking for file conflicts                  [----------------------]   0%(1/1) checking for file conflicts                  [######################] 100%
(0/1) checking available disk space                [----------------------]   0%(1/1) checking available disk space                [######################] 100%
:: Processing package changes...
(1/1) reinstalling rar                             [----------------------]   0%(1/1) reinstalling rar                             [######################] 100%
:: Running post-transaction hooks...
(1/1) Arming ConditionNeedsUpdate...
</pre>
</div>
</div>
</div>
