blog/2018/06/07/linux下rar文件常用操作/index.html

<div id="outline-container-orgbdca082" class="outline-2">
<h2 id="orgbdca082">rar命令常见操作</h2>
<div class="outline-text-2" id="text-orgbdca082">
<p>
直接运行 <code>rar</code> 命令就会列出所有可用的操作及其说明
</p>
<div class="org-src-container">
<pre class="src src-shell">rar
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">
RAR 5.50   Copyright (c) 1993-2017 Alexander Roshal   11 Aug 2017
Trial version             Type 'rar -?' for help

Usage:     rar &lt;command&gt; -&lt;switch 1&gt; -&lt;switch N&gt; &lt;archive&gt; &lt;files...&gt;
               &lt;@listfiles...&gt; &lt;path_to_extract\&gt;

&lt;Commands&gt;
  a             Add files to archive
  c             Add archive comment
  ch            Change archive parameters
  cw            Write archive comment to file
  d             Delete files from archive
  e             Extract files without archived paths
  f             Freshen files in archive
  i[par]=&lt;str&gt;  Find string in archives
  k             Lock archive
  l[t[a],b]     List archive contents [technical[all], bare]
  m[f]          Move to archive [files only]
  p             Print file to stdout
  r             Repair archive
  rc            Reconstruct missing volumes
  rn            Rename archived files
  rr[N]         Add data recovery record
  rv[N]         Create recovery volumes
  s[name|-]     Convert archive to or from SFX
  t             Test archive files
  u             Update files in archive
  v[t[a],b]     Verbosely list archive contents [technical[all],bare]
  x             Extract files with full path

&lt;Switches&gt;
  -             Stop switches scanning
  @[+]          Disable [enable] file lists
  ad            Append archive name to destination path
  ag[format]    Generate archive name using the current date
  ai            Ignore file attributes
  ap&lt;path&gt;      Set path inside archive
  as            Synchronize archive contents
  c-            Disable comments show
  cfg-          Disable read configuration
  cl            Convert names to lower case
  cu            Convert names to upper case
  df            Delete files after archiving
  dh            Open shared files
  ds            Disable name sort for solid archive
  dw            Wipe files after archiving
  e[+]&lt;attr&gt;    Set file exclude and include attributes
  ed            Do not add empty directories
  en            Do not put 'end of archive' block
  ep            Exclude paths from names
  ep1           Exclude base directory from names
  ep3           Expand paths to full including the drive letter
  f             Freshen files
  hp[password]  Encrypt both file data and headers
  ht[b|c]       Select hash type [BLAKE2,CRC32] for file checksum
  id[c,d,p,q]   Disable messages
  ierr          Send all messages to stderr
  ilog[name]    Log errors to file (registered versions only)
  inul          Disable all messages
  isnd          Enable sound
  iver          Display the version number
  k             Lock archive
  kb            Keep broken extracted files
  log[f][=name] Write names to log file
  m&lt;0..5&gt;       Set compression level (0-store...3-default...5-maximal)
  ma[4|5]       Specify a version of archiving format
  mc&lt;par&gt;       Set advanced compression parameters
  md&lt;n&gt;[k,m,g]  Dictionary size in KB, MB or GB
  ms[ext;ext]   Specify file types to store
  mt&lt;threads&gt;   Set the number of threads
  n&lt;file&gt;       Additionally filter included files
  n@            Read additional filter masks from stdin
  n@&lt;list&gt;      Read additional filter masks from list file
  o[+|-]        Set the overwrite mode
  oh            Save hard links as the link instead of the file
  oi[0-4][:min] Save identical files as references
  ol[a]         Process symbolic links as the link [absolute paths]
  or            Rename files automatically
  ow            Save or restore file owner and group
  p[password]   Set password
  p-            Do not query password
  qo[-|+]       Add quick open information [none|force]
  r             Recurse subdirectories
  r-            Disable recursion
  r0            Recurse subdirectories for wildcard names only
  rr[N]         Add data recovery record
  rv[N]         Create recovery volumes
  s[&lt;N&gt;,v[-],e] Create solid archive
  s-            Disable solid archiving
  sc&lt;chr&gt;[obj]  Specify the character set
  sfx[name]     Create SFX archive
  si[name]      Read data from standard input (stdin)
  sl&lt;size&gt;      Process files with size less than specified
  sm&lt;size&gt;      Process files with size more than specified
  t             Test files after archiving
  ta&lt;date&gt;      Process files modified after &lt;date&gt; in YYYYMMDDHHMMSS format
  tb&lt;date&gt;      Process files modified before &lt;date&gt; in YYYYMMDDHHMMSS format
  tk            Keep original archive time
  tl            Set archive time to latest file
  tn&lt;time&gt;      Process files newer than &lt;time&gt;
  to&lt;time&gt;      Process files older than &lt;time&gt;
  ts[m|c|a]     Save or restore file time (modification, creation, access)
  u             Update files
  v&lt;size&gt;[k,b]  Create volumes with size=&lt;size&gt;*1000 [*1024, *1]
  ver[n]        File version control
  vn            Use the old style volume naming scheme
  vp            Pause before each volume
  w&lt;path&gt;       Assign work directory
  x&lt;file&gt;       Exclude specified file
  x@            Read file names to exclude from stdin
  x@&lt;list&gt;      Exclude files listed in specified list file
  y             Assume Yes on all queries
  z[file]       Read archive comment from file
</pre>
</div>
</div>

<div id="outline-container-org28ebb32" class="outline-3">
<h3 id="org28ebb32">创建rar压缩包</h3>
<div class="outline-text-3" id="text-org28ebb32">
<p>
使用 <code>a</code> 子命令来生成rar压缩包，其语法为(注意不要在a前面加上"-")
</p>
<div class="org-src-container">
<pre class="src src-shell">rar a $<span style="color: #4f97d7;">{</span><span style="color: #7590db;">rar_file</span><span style="color: #4f97d7;">}</span> $<span style="color: #4f97d7;">{</span><span style="color: #7590db;">files_or_folds</span><span style="color: #4f97d7;">}</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">
RAR 5.50   Copyright (c) 1993-2017 Alexander Roshal   11 Aug 2017
Trial version             Type 'rar -?' for help

Evaluation copy. Please register.

Creating archive ahk.rar

Adding    &#25105;&#30340;AHK/DesktopSwitch.ahk                                        &#8;&#8;&#8;&#8;  0%&#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/scripts/DesktopSwitch.ahk                                &#8;&#8;&#8;&#8;  1%&#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/scripts/winautohide.ahk                                  &#8;&#8;&#8;&#8;  2%&#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/scripts/hotStringHelper.ahk                              &#8;&#8;&#8;&#8;  2%&#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/scripts/ScriptSetting v1.0.3.ahk                         &#8;&#8;&#8;&#8;  3%&#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/scripts/AHK-gVim-by-sfufoet.ahk                          &#8;&#8;&#8;&#8;  4%&#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/Recorder.zip                                             &#8;&#8;&#8;&#8;  5%&#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/resources/ahk.ico                                        &#8;&#8;&#8;&#8; 94%&#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/AHK_Script_Manager.ahk                                   &#8;&#8;&#8;&#8; 95%&#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/includes/LibINI.ahk                                      &#8;&#8;&#8;&#8; 97%&#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/template.ahk                                             &#8;&#8;&#8;&#8; 97%&#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/scripts                                                  &#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/resources                                                &#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK/includes                                                 &#8;&#8;&#8;&#8;&#8;  OK 
Adding    &#25105;&#30340;AHK                                                          &#8;&#8;&#8;&#8;&#8;  OK 
Done
</pre>
</div>
</div>
</div>
